{
  "name": "Variable Sweeps",
  "icon": "footwork:textures/entry_icons/moveset.png",
  "category": "footwork:selfdefense",
  "sortnum": 4,
  "pages": [
    {
      "type": "patchouli:image",
	  "images": [
	  "footwork:textures/guide/moveset_example.png"
	  ],
	  "border": true,
      "text": "Also known as a \"Moveset\".",
	  "title": "Variable Sweeps"
    },
    {
      "type": "patchouli:text",
      "text": "When $(l:patchouli:wartheory/gearcheck)\"holding shift on an item\"$() you will potentially come across a shockingly large amount of information.$(br)The information here is how you can dynamically alter your attacks with the 5 main movements and various weapons.$(br2)Initially all I can really say is to not spam, and test out your weapons with up to 5 different primary movements: $(l)standing/walking, sprinting, sneaking, falling, and riding/mounted$() to get a feel of how you should use them."
    },
    {
      "type": "patchouli:image",
	  "images": [
	  "footwork:textures/guide/sweeps_visualized.png"
	  ],
	  "border": true,
      "text": "The new size dependent sweep particles.",
	  "title": "The Sweeps"
    },
    {
      "type": "patchouli:text",
      "text": "There are $(l)6 attack types$() which are further modified as described on their items. $(o)Fan, cleave, line, impact, Circle and none.$(br2)$(l)Fan$() sweeps in a directional horizontal wedge shaped area with the given degree, hitting all foes for the described modifiers. $(br2)$(l)Cleave$() is a vertical version that hits a narrow vertical sector, making it suited for threats coming from above or below.$(br2)$(l)Line$() pierces forward up to the weapon's max reach. The radius both widens the line's hitbox and slightly increases it beyond max reach."
    },
    {
      "type": "patchouli:text",
      "text": "$(l)Impact$() takes the location of hitting, whether it be the maximum range, a block or an entity, and creates a circular impact point which is visibly shown by the dust particles around the sweep effect.$(br2)$(l)Circle$() hits all foes in a circular area around you with a given radius. This is usually a set distance, and weapons with extended reach can still directly strike the foes even outside the defined circle. $(br2)$(l)None$() is simply no sweeping is present, it only hits under your cursor."
    },
    {
      "type": "patchouli:text",
      "text": "Provided you can install the $(l)Sweeping Edge enchantment$() onto your weapon or item of choice, all sweep sizes (other than none) can be improved.$(br2)Similar to vanilla, sweep attacks of any given type will only trigger when swinging a weapon at 90% or higher charge. Unlike vanilla, sweeps will only trigger in combat mode to prevent accidental friendly fire. Combo your different swings for different purposes based on the weapon for more dynamic combat. Becoming blinded will also nullify the ability to sweep."
    }
  ]
}