{
  "name": "Checking your Gear",
  "icon": "wardance:textures/entry_icons/gearcheck.png",
  "category": "patchouli:wartheory",
  "sortnum": 3,
  "pages": [
    {
      "type": "patchouli:image",
	  "images": [
	  "wardance:textures/guide/weapon_stats.png"
	  ],
	  "border": true,
      "text": "Three displays for your weapon balance curiosity. Shift, Alt and possibly control.",
	  "title": "Checking Your Gear"
    },
    {
      "type": "patchouli:text",
      "text": "In War dance, not all weapons are quite the same. Unlike vanilla where most weapons are swords or retextures of swords or other kinds of tools that happen to deal damage, War Dance hopes to mix up your actual options by provided a number of stats with which to craft yourself a combat style and strategy.$(br2)This is most obviously observed when you inspect any items which have been configured to work by your pack makers or provided by Darkmega's cross compatibility patch linked on War dance's main page." 
    },
    {
      "type": "patchouli:text",
      "text": "Upon holding shift you may notice various stats such as: $(o)\"posture per attack\"$(), or $(o)\"defense posture multiplier\"$(), and number of layers of further words such as $(o)when standing, when falling$() etc that dictate the various attack states a player can utilize to morph a weapon's sweep area to deal varying levels of damage in different area sizes as part of their $(l:patchouli:selfdefense/movesets)\"moveset\"$(). $(br2)Put simply, posture per attack is the damage the weapon would normally deal when attacked with at full charge with no bonuses from passive skills or sweep types."
    },
    {
      "type": "patchouli:text",
      "text": "Defense posture multiplier is the change to posture damage taken when $(l:patchouli:selfdefense/parry0)parrying$() a blow with that weapon or tool.$(br2)On some tools and weapons you can hold alt to check it's other special properties. For example any shield or item which can act as a shield will display it in here.$(br2)Another example is a weapon which can disable a vanilla shield like an axe, or a weapon which must be wielded twohanded will also appear mentioned here."
    },
    {
      "type": "patchouli:text",
      "text": "Holding ctrl you can inspect a weapon for the bonuses that you'll acquire for $(l:patchouli:selfdefense/solowielding)Solowielding$() the weapon. $(br2)The various attributes are a mixture of vanilla and footwork based stats."
    }
  ]
}