{
  "wardance.tooltip.postureAttack": "Posture per attack: %.2d",
  "wardance.tooltip.postureDefend": "Defense posture multiplier: %.2d",
  "wardance.tooltip.parry": "Parries up to %s times per %.2d seconds",
  "wardance.tooltip.attack": "Ambushes distracted targets for %s damage and unaware targets for %s damage",
  "wardance.absorption": "Absorption",
  "wardance.deflection": "Deflection Angle",
  "wardance.shatter": "Shatter",
  "wardance.combat.on": "Combat Mode Activated",
  "wardance.combat.off": "Combat Mode Deactivated",
  "wardance.combat": "Toggle Combat Mode",
  "wardance.selectSkill": "Open Skill Selection GUI",
  "wardance.skill": "Casting Menu (Combat Mode only)",
  "wardance.quickSkill": "Cast Last Used Skill (Combat Mode only)",
  "wardance:heavy_blow.name": "Heavy Blow",
  "wardance:exhaustion": "Exhaustion",
  "wardance:distraction": "Distraction",
  "wardance:sleep": "Sleep",
  "wardance:paralysis": "Paralysis",
  "wardance:petrify": "Petrified",
  "wardance:confusion": "Confused",
  "wardance:backstab.name": "Backstab",
  "wardance:poise.name": "Poise",
  "wardance:stagger.name": "Stagger",
  "wardance:vault.name": "Vault",
  "wardance:shatter.name": "Shatter",
  "wardance:iron_guard.name": "Iron Guard",
  "wardance:backpedal.name": "Backpedal",
  "wardance:bind.name": "Bind",
  "wardance:mikiri.name": "Mikiri",
  "wardance:overpower.name": "Overpower",
  "wardance:recovery.name": "Recovery",
  "wardance:coup_de_grace.name": "Coup de Grace",
  "wardance:reinvigorate.name": "Reinvigorate",
  "wardance:silencer.name": "Silencer",
  "wardance:frenzy.name": "Frenzy",
  "wardance:kick.name": "Kick",
  "wardance:iron_knee.name": "Iron Knee",
  "wardance:tackle.name": "Tackle",
  "wardance:backflip.name": "Backflip",
  "wardance:low_sweep.name": "Low Sweep",
  "wardance:trip.name": "Trip",
  "wardance:grapple.name": "Grapple",
  "wardance:clinch.name": "Clinch",
  "wardance:suplex.name": "Suplex",
  "wardance:submission.name": "Submission",
  "wardance:reversal.name": "Reversal",
  "wardance:shield_bash.name": "Shield Bash",
  "wardance:rim_punch.name": "Rim Punch",
  "wardance:foot_slam.name": "Foot Slam",
  "wardance:overbear.name": "Overbear",
  "wardance:berserk.name": "Berserk",
  "wardance:arm_lock.name": "Arm Lock",
  "wardance:heavy_blow.desc": "The next attack in 2 seconds launches a vicious strike, guaranteeing a crit if it lands. If the target parries the blow, their parrying hand will be disabled for 1.5 seconds. Recharges after 3 attacks, offensive bonuses are not applied if the target has Iron Guard active.",
  "wardance:backstab.desc": "§nApplies distraction bonus to damage, additionally ignores target armor if attacking their backside.",
  "wardance:poise.desc": "§nParries become free until this skill expires or an attack is launched.",
  "wardance:stagger.desc": "§nAdds up to 1.3 seconds of slowness and 5 posture damage depending on how slow your weapon is.",
  "wardance:vault.desc": "§n+2 range for the attack and dash backwards slightly.",
  "wardance:shatter.desc": "§nBind time and crit damage multiplier increases by 20% for every different skill casted by your last five successful casts",
  "wardance:iron_guard.desc": "Brace yourself for impact, causing the next parry in 1.5 seconds to reflect all posture damage back onto the attacker. If the attack was ranged, the projectile reflected back at its shooter with full force. Recharge after 5 parries, offensive bonuses are not applied if the melee attacker had Heavy Blow active.",
  "wardance:backpedal.desc": "§nInstead of reflecting posture damage, all posture damage taken is converted to knockback.",
  "wardance:bind.desc": "§nThe attacker's attacking hand will be bound for 2 seconds on parry.",
  "wardance:mikiri.desc": "§nIron guard automatically triggers, cooldown -1",
  "wardance:overpower.desc": "§nAdditionally consume posture from the attacker as if attacking with the parrying weapon.",
  "wardance:recovery.desc": "§nYour posture and spirit cooldowns are reset, and your might and combo grace period are refilled, upon parry.",
  "wardance:coup_de_grace.desc": "Toggle on to additionally deal one life's worth of damage to a staggered target, scaled from half to 1.5x the amount depending on the amount of health it has already lost, when dealing damage to it, instantly ending their stagger. If this kills the target, gain 1 might. Monsters have an amount of lives equal to the natural logarithm of their max health minus one, and players always have three. Cast when active to toggle off.",
  "wardance:reinvigorate.desc": "§nKills will additionally regenerate health, posture, and spirit by an amount equal to 10% of the target's life, and heal wounding, fatigue, and burnout by an equivalent amount.",
  "wardance:silencer.desc": "§nAdditionally triggers this skill when attacking an unaware target.",
  "wardance:frenzy.desc": "§nAll physical skills instantly cool down on a kill.",
  "wardance:kick.desc": "The next attack in 2 seconds only has a range of 2 blocks, but deals 6 unblockable posture damage and 1 point of falling block damage. Recharge after 5 attacks.",
  "wardance:iron_knee.desc": "§nAll knockback from the attack is converted into additional posture damage",
  "wardance:tackle.desc": "§n+2 range on kick and dashes forward",
  "wardance:backflip.desc": "§nUse the reaction force from the kick to leap back and recover 30% lost posture.",
  "wardance:low_sweep.desc": "§nKicks sweep a 60 degree area in front of you.",
  "wardance:trip.desc": "§nUsable only when both you and your target are grounded. Reduce target posture regeneration by 60% for an amount of time equal to double its posture cooldown. Cooldown -1.",
  "wardance:grapple.desc": "Landing two unarmed strikes on the same target in 3 seconds after casting this skill will grab and throw them to the ground for 10 posture damage. Recharge after 7 attacks.",
  "wardance:clinch.desc": "§nThe hand performing the first unarmed strike will bind the same hand on the target. If both hands are empty, both of the target's hands will be simultaneously bound.",
  "wardance:suplex.desc": "§nGrab the target and brutally slam them behind you, dealing double of your current posture as true posture damage to the target, but also consuming almost all of your own posture.",
  "wardance:submission.desc": "§nGrapple triggers on first strike and has its cooldown reduced by 2 if you have more armor than your target.",
  "wardance:reversal.desc": "§nA successful grapple instead swaps the posture of the attacker and target by percentage.",
  "wardance:shield_bash.desc": "For 2 seconds, your shield will behave as a range 2 blunt weapon that deals additional posture damage equivalent to its shield time. Recharge in 4 parries.",
  "wardance:rim_punch.desc": "§nSmash the shield's rim into the target, gaining +1 range for the attack and nauseating them for 2 seconds.",
  "wardance:foot_slam.desc": "§nSlam the shield into the enemy's foot, slowing and distracting them for 3 seconds.",
  "wardance:overbear.desc": "§nPut all your weight into the attack, dealing extra damage equal to double your shield time and doubling posture damage. If this does not stagger the target, slows you for 2.5 seconds.",
  "wardance:berserk.desc": "§nUpon cast and successful attack with shield, recharge both hands and increase your attack speed by 30% for 1.5 seconds.",
  "wardance:arm_lock.desc": "§nParrying with this skill active will bind the attacker's attacking hand for 1.5 seconds. Cooldown +1.",
  "wardance:": ""
}