{
  "wardance.tooltip.postureAttack": "Posture per attack: %.2d",
  "wardance.tooltip.postureDefend": "Defense posture multiplier: %.2d",
  "wardance.tooltip.parry": "Parries up to %s times per %.2d seconds",
  "wardance.tooltip.attack": "Ambushes distracted targets for %s damage and unaware targets for %s damage",

  "wardance.absorption": "Absorption",
  "wardance.deflection": "Deflection Angle",
  "wardance.shatter": "Shatter Ticks",
  "wardance.stealth": "Stealth",

  "wardance.combat.on": "Combat Mode Activated",
  "wardance.combat.off": "Combat Mode Deactivated",
  "wardance.combat": "Toggle Combat Mode",
  "wardance.selectSkill": "Open Skill Selection GUI",
  "wardance.skill": "Casting Menu (Combat Mode only)",
  "wardance.quickSkill": "Cast Last Used Skill (Combat Mode only)",

  "wardance.skill.cooldown": "skill is cooling down",
  "wardance.skill.conflict": "conflicting skills are currently active",

  "wardance:exhaustion": "Exhaustion",
  "wardance:distraction": "Distraction",
  "wardance:sleep": "Sleep",
  "wardance:paralysis": "Paralysis",
  "wardance:petrify": "Petrified",
  "wardance:confusion": "Confused",

  "wardance:heavy_blow.name": "Heavy Blow",
  "wardance:heavy_blow.desc": "The next attack in 2 seconds launches a vicious strike, guaranteeing a crit if it lands and dealing 1.4x damage. If the target parries the blow, their parrying hand will be disabled for 1.5 seconds. Recharges after 3 attacks, costs 1 might.\nOffensive bonuses are not applied if the target has Iron Guard active.",
  "wardance:heavy_blow.requirement": "requires at least 1 might",
  "wardance:backstab.name": "Backstab",
  "wardance:backstab.desc": " Automatically cast heavy blow for free when attacking an unaware target, if it is not in cooldown.",
  "wardance:backstab.requirement": "requires at least 1 might",
  "wardance:poise.name": "Poise",
  "wardance:poise.desc": " Parries become free until this skill expires or an attack is launched.",
  "wardance:poise.requirement": "requires at least 1 might",
  "wardance:stagger.name": "Stagger",
  "wardance:stagger.desc": " Adds up to 1.3 seconds of slowness and 5 posture damage depending on how slow your weapon is.",
  "wardance:stagger.requirement": "requires at least 1 might",
  "wardance:vault.name": "Vault",
  "wardance:vault.desc": " +2 range for the attack and dash backwards slightly.",
  "wardance:vault.requirement": "requires at least 1 might",
  "wardance:shatter.name": "Shatter",
  "wardance:shatter.desc": " Bind time and crit damage multiplier scales with combo.",
  "wardance:shatter.requirement": "requires at least 1 might",
  "wardance:iron_guard.name": "Iron Guard",
  "wardance:iron_guard.desc": "Brace yourself for impact, causing the next parry in 1.5 seconds to reflect all posture damage back onto the attacker. If the attack was ranged, the projectile reflected back at its shooter with full force. Recharge after 5 parries.\nOffensive bonuses are not applied if the melee attacker had Heavy Blow active.",
  "wardance:backpedal.name": "Backpedal",
  "wardance:backpedal.desc": " Instead of reflecting posture damage, all posture damage taken is converted to knockback.",
  "wardance:bind.desc": " The attacker's attacking hand will be bound for 2 seconds on parry.",
  "wardance:bind.name": "Bind",
  "wardance:mikiri.name": "Mikiri",
  "wardance:mikiri.desc": " Iron guard automatically triggers, cooldown +1",
  "wardance:overpower.name": "Overpower",
  "wardance:overpower.desc": " Additionally consume posture from the attacker as if attacking with the parrying weapon.",
  "wardance:recovery.name": "Recovery",
  "wardance:recovery.desc": " Your posture and spirit cooldowns are reset, and your might and combo grace period are refilled, upon parry.",
  "wardance:coup_de_grace.name": "Coup de Grace",
  "wardance:coup_de_grace.desc": "When toggled, all damage dealt to targets with less than 20% health (including wounding) will be converted to posture. An attack on a staggered target under 20% will instantly kill and give 1 might. Cast when active to end this skill. Recharge after 2 skill casts.",
  "wardance:rupture.name":"Rupture",
  "wardance:rupture.desc": " Absorb half the target's spirit and cause the other half to violently escape in a large explosion. The size of the explosion is the square root of the target's max posture, and it deals up to (2*spirit) explosion damage to non-allies caught in the blast radius.",
  "wardance:reinvigorate.name": "Reinvigorate",
  "wardance:reinvigorate.desc": " Kills will additionally restore health, posture, and spirit by an amount equal to 10% of the target's life, and heal wounding, fatigue, and burnout by an equivalent amount.",
  "wardance:reaping.name": "Reaping",
  "wardance:reaping.desc": " Activate to gain omnidirectional sweep. This attack cannot be parried, targets below ((5% of max health)+(weapon damage)*2) will take true damage, and this skill instantly refreshes if a target dies in this manner. Cooldown +3.",
  "wardance:frenzy.name": "Frenzy",
  "wardance:frenzy.desc": " All physical skills instantly cool down on a kill.",
  "wardance:danse_macabre.name":"Danse Macabre",
  "wardance:danse_macabre.desc": " The percentage at which an entity is eligible for execution scales with your combo, up to 40%.",
  "wardance:kick.name": "Kick",
  "wardance:kick.desc": "The next attack in 2 seconds only has a range of 3 blocks, but deals 6 unblockable posture damage and 1 point of falling block damage. Recharge after 5 attacks.",
  "wardance:trip.name": "Trip",
  "wardance:trip.desc": " Usable only when both you and your target are grounded. Reduce target posture regeneration by 60% for an amount of time equal to double its posture cooldown. Cooldown -1.",
  "wardance:trip.requirement": "you are not grounded",
  "wardance:tackle.name": "Tackle",
  "wardance:tackle.desc": " +2 range on kick and dash forward.",
  "wardance:low_sweep.name": "Low Sweep",
  "wardance:low_sweep.desc": " Kicks sweep a 90 degree area in front of you.",
  "wardance:iron_knee.name": "Iron Knee",
  "wardance:iron_knee.desc": " All knockback from the attack is converted into additional posture damage.",
  "wardance:backflip.name": "Backflip",
  "wardance:backflip.desc": " Use the reaction force to leap back and recover 30% lost posture, adds 0.4 combo.",
  "wardance:grapple.name": "Grapple",
  "wardance:grapple.desc": "Landing two unarmed strikes on the same target in 3 seconds after casting this skill will grab and throw them to the ground for 10 posture damage. Recharge after 7 attacks.",
  "wardance:suplex.name": "Suplex",
  "wardance:suplex.desc": " Grab the target and brutally slam them behind you, dealing double of your current posture as true posture damage to the target, but also consuming almost all of your own posture.",
  "wardance:submission.name": "Submission",
  "wardance:submission.desc": " Grapple triggers on first strike and has its cooldown reduced by 2 if you have more armor than your target.",
  "wardance:reversal.name": "Reversal",
  "wardance:reversal.desc": " A successful grapple instead swaps the posture of the attacker and target by percentage.",
  "wardance:clinch.name": "Clinch",
  "wardance:clinch.desc": " The hand performing the first unarmed strike will bind the same hand on the target. If both hands are empty, both of the target's hands will be simultaneously bound.",
  "wardance:shield_bash.name": "Shield Bash",
  "wardance:shield_bash.desc": "In the next 2 seconds, your shield will behave as a range 3 blunt weapon once, dealing additional posture damage equivalent to its shield time. Recharge in 4 parries.",
  "wardance:rim_punch.name": "Rim Punch",
  "wardance:rim_punch.desc": " Smash the shield's rim into the target, nauseating them for 2 seconds and inflicting additional knockback.",
  "wardance:overbear.name": "Overbear",
  "wardance:overbear.desc": " Put all your weight into the attack, dealing extra damage equal to double your shield time and doubling posture damage. If this does not stagger the target, slows you for 2.5 seconds.",
  "wardance:foot_slam.name": "Foot Slam",
  "wardance:foot_slam.desc": " Slam the shield into the enemy's foot, slowing and distracting them for 3 seconds.",
  "wardance:berserk.name": "Berserk",
  "wardance:berserk.desc": " Upon cast and successful attack with shield, recharge both hands and increase your attack speed by 30% for 2.5 seconds.",
  "wardance:arm_lock.name": "Arm Lock",
  "wardance:arm_lock.desc": " Parrying with this skill active will bind the attacker's attacking hand for 1.5 seconds. Cooldown +1.",
  "wardance:fighting_spirit.name": "Meditate/War Cry",
  "wardance:fighting_spirit.sleep.name": "Meditate",
  "wardance:fighting_spirit.nosleep.name": "War Cry",
  "wardance:fighting_spirit.desc": "All of this skill's variations have a passive that will function until the skill enters cooldown. When cast at full posture, no might, and full spirit, this skill will simulate a full night's sleep after five seconds of not taking damage, during which time you are immobile; otherwise, you gain a series of buffs. The base form grants regeneration and absorption for 10 seconds. Recharge after 5 minutes or sleeping in a bed.",
  "wardance:wind_scar.name": "Wind Scar",
  "wardance:wind_scar.desc": " §lPassive:§r +1 block reach. \n§l Active:§r gain omnidirectional sweeping for 10 seconds.",
  "wardance:timberfall.name": "Timberfall",
  "wardance:timberfall.desc": " §lPassive:§r 5x the might generated is added to posture damage on attack. \n§l Active:§r guarantee crit and +40% dealt melee damage for 10 seconds.",
  "wardance:frost_fang.name": "Frost Fang",
  "wardance:frost_fang.desc": " §lPassive:§r +2 luck. \n§l Active:§r for 20 seconds, gain 40% speed and slow enemies for 3 seconds on hit; if they are alert, they are additionally blinded for 1 second.",
  "wardance:flame_dance.name": "Flame Dance",
  "wardance:flame_dance.desc": " §lPassive:§r attack speed increases by 0.1 for every level of combo. \n§l Active:§r for 20 seconds, every third hit will crit for an additional 1.5x damage and cause your next parry to be free.",
  "wardance:boulder_brace.name": "Boulder Brace",
  "wardance:boulder_brace.desc": " §lPassive:§r halved posture cooldown time. \n§l Active:§r restore all posture; for 10 seconds, regenerate 1 posture per second regardless of cooldown.",
  "wardance:feint.name": "Feint",
  "wardance:feint.desc": "The next attack in 2.5 seconds tricks the opponent into guarding against it. If it is parried, both hands of the target will be reset; if it is not parried, all damage dealt is converted into posture damage. This cannot stagger the target. Recharge in 3 attacks.",
  "wardance:upper_hand.name": "Upper Hand",
  "wardance:upper_hand.desc": " Recover an equivalent amount of posture.",
  "wardance:smirking_shadow.name": "Smirking Shadow",
  "wardance:smirking_shadow.desc": " Teleport 2 blocks behind the target after the attack.",
  "wardance:scorpion_sting.name": "Scorpion Sting",
  "wardance:scorpion_sting.desc": " This attack will trigger effects that apply on damage if it is not parried.",
  "wardance:last_surprise.name": "Last Surprise",
  "wardance:last_surprise.desc": " The target is distracted for 3 seconds.",
  "wardance:crown_champion.name": "Crown Champion",
  "wardance:crown_champion.desc": "Gain 5% extra attack damage per level of might.",
  "wardance:vengeful_might.name": "Vengeful Might",
  "wardance:vengeful_might.desc": " Gain 10% of damage received as might. Your combo meter only decreases upon sustaining damage, and your attacker will be highlighted for 5 seconds.",
  "wardance:prideful_might.name": "Prideful Might",
  "wardance:prideful_might.desc": " Might gain is tripled, but all might is lost when taking damage. After gaining 3 levels of might, your shatter will instantly cool down.",
  "wardance:hidden_might.name": "Hidden Might",
  "wardance:hidden_might.desc": " Gain 0.5 might from an unaware attack. The distance at which you are detected is reduced by 30%; for every level of might you gain, 3% of this detection is converted to speed.",
  "wardance:elemental_might.name": "Elemental Might",
  "wardance:elemental_might.desc": " Attacking a target causes it to take 1 more damage from non-physical sources for the next 5 seconds; gain 1 might when an entity in 5 blocks dies from non-physical damage.",
  "wardance:execution.name": "Execution",
  "wardance:execution.desc": "Costs 8 might to activate. Converts all dealt melee damage to posture, and takes one life's worth of health from the target on stagger, ending their stagger instantly.\nMonsters have an amount of lives equal to the natural logarithm of their max health minus one, and players always have three.",
  "wardance:execution.requirement": "requires 8 might",
  "wardance:onslaught.name": "Onslaught",
  "wardance:onslaught.desc": " Your equipped variation of heavy blow (defaulting to the base variation if it is not equipped) will be automatically cast, costing might as normal but ignoring cooldown.",
  "wardance:onslaught.requirement": "requires 8 might",
  "wardance:masters_lesson.name": "Master's Lesson",
  "wardance:masters_lesson.desc": " While active, all generated might will be converted into free parries at a 1:1 ratio.",
  "wardance:masters_lesson.requirement": "requires 8 might",
  "wardance:flare.name": "Flare",
  "wardance:flare.desc": " Take two lives, then cause the target to rapidly regenerate 1.4 lives.",
  "wardance:flare.requirement": "requires 8 might",
  "wardance:endless_might.name": "Endless Might",
  "wardance:endless_might.desc": " Only requires 5 might to activate.",
  "wardance:endless_might.requirement": "requires 5 might",
  "wardance:crowd_pleaser.name": "Crowd Pleaser",
  "wardance:crowd_pleaser.desc": " After taking a life, allies within 10 blocks gain buffs for half the duration of the life's worth in health. For every two skills cast during execution, every existing buff increases in potency, and an additional buff is applied. Speed and strength are applied first, then luck, regeneration, and finally resistance (capped at resistance III).",
  "wardance:crowd_pleaser.requirement": "requires 8 might",
  "wardance:memento_mori.name": "Memento Mori",
  "wardance:memento_mori.desc": "For every 1% health lost (including wounding), you gain 1% extra might and 0.5% extra damage.",
  "wardance:rapid_clotting.name": "Rapid Clotting",
  "wardance:rapid_clotting.desc": " Gain (lost health percentage*20) armor.",
  "wardance:panic.name": "Panic",
  "wardance:panic.desc": " When taking damage, create a smoke cloud that blinds all enemies in 10 blocks whose distance to you exceeds (current health percentage*10) blocks.",
  "wardance:death_denial.name": "Death Denial",
  "wardance:death_denial.desc": " Upon taking fatal damage, become immune to all damage and healing for 5 seconds. Recharges after sleeping.",
  "wardance:saving_throw.name": "Saving Throw",
  "wardance:saving_throw.desc": " Additionally gain 0.1 luck per 1% lost health.",
  "wardance:pound_of_flesh.name": "Pound of Flesh",
  "wardance:pound_of_flesh.desc": " Active skill, consumes all your spirit. When attacking, consume 5% max health to deal 5% of the target's max health, or 10% of the target's max posture if the attack was parried. Lasts until (2*spirit) seconds have elapsed or your spirit fully regenerates.",
  "wardance:descend.name": "Descend",
  "wardance:descend.desc": "Can only be cast when standing on the ground. Until you touch the ground again, your next attack will additionally deal (fall distance*2) posture damage and (fall distance) falling block damage; performing said attack will negate fall damage. Recharges after 6 attacks, with distracted attacks counting as 2 and unaware attacks counting as 4 attacks.",
  "wardance:descend.requirement": "you are not grounded",
  "wardance:hawk_dive.name": "Phantom Dive",
  "wardance:hawk_dive.desc": " Can be cast while airborne. If you are flying with an elytra, you will automatically stop flying. Every 7 blocks fallen upgrades the attack's ambush tier (alert->distracted->unaware); every upgrade beyond unaware paralyzes the target for for 3 seconds.",
  "wardance:lights_out.name": "Lights Out",
  "wardance:lights_out.desc": " If the target is staggered by this attack, it will be blinded and stagger time will be lengthened to 10 seconds, but stagger count will be set to 1.",
  "wardance:lights_out.requirement": "you are not grounded",
  "wardance:shockwave.name": "Shockwave",
  "wardance:shockwave.desc": " Landing without using the skill will create a shockwave that deals (fall distance/2) posture damage to all entities within 4 blocks, negating fall damage.",
  "wardance:shockwave.requirement": "you are not grounded",
  "wardance:titans_fall.name": "Titanfall",
  "wardance:titans_fall.desc": " Consumes all of your own posture and deal it as additional damage to the target, increased by 4% per armor point you have.",
  "wardance:titans_fall.requirement": "you are not grounded",
  "wardance:hex.name": "Hex",
  "wardance:hex.desc": "In the next 3 seconds, your next attack will deal no damage but reduce the target's luck by 2 for 10 seconds if it is not parried. Costs 3 spirit and cools down in 15 seconds.",
  "wardance:hex.requirement": "requires 3 spirit",
  "wardance:itchy_curse.name": "Itchy Curse",
  "wardance:itchy_curse.desc": " Inflicts a form of paresthesia on the target. Paresthesia lasts 3 seconds, but only ticks down if the target is not moving. The target is treated as distracted, and will be immobilized with both its hands bound every 3 seconds.",
  "wardance:itchy_curse.requirement": "requires 3 spirit",
  "wardance:snakebite.name": "Snakebite",
  "wardance:snakebite.desc": "Inflicts a minimum of poison II for 10 seconds on the target, taking the higher value for both duration and potency if the target already has poison active, and renders it incurable by milk. The target cannot heal as long as the poison effect remains active.",
  "wardance:snakebite.requirement": "requires 3 spirit",
  "wardance:unravel.name": "Unravel",
  "wardance:unravel.desc": "This effect cannot be parried. Violently removes one level from every potion effect curable by milk on the target, creating an explosion. The size of the explosion scales with the duration of all effects on the target, up to a 10 block radius; the damage at the center of the explosion increases by 4*(former effect level) per effect that had its potency reduced, and 2 per effect that did not.",
  "wardance:unravel.requirement": "requires 3 spirit",
  "wardance:black_mark.name": "Black Mark",
  "wardance:black_mark.desc": " Saps the target of its vitality. For 10 seconds, any creature that deals damage to the target will heal for 1/3 the dealt damage and drain either 2 posture or 3 spirit, whichever the attacker has less of, recovering half that amount.",
  "wardance:black_mark.requirement": "requires 3 spirit",
  "wardance:petrify.name": "Stiffen",
  "wardance:petrify.desc": "Additionally converts absorption, deflection, and 30% armor into an equivalent amount of shatter.",
  "wardance:petrify.requirement": "requires 3 spirit",
  "wardance:.name": "",
  "wardance:.desc": "",
  "wardance:.requirement": "",
  "wardance:": ""
}