{
  "name": "Fractures [0]: basics",
  "icon": "wardance:textures/entry_icons/fracture0.png",
  "category": "patchouli:selfdefense",
  "sortnum": 3,
  "anchor": "fracture0",
  "pages": [
    {
      "type": "patchouli:image",
	  "images": [
	  "wardance:textures/guide/fractures_start.png"
	  ],
	  "border": true,
      "text": "Fractures on the hud are represented by a sleeve of green on the upper and lower border of the posture bar. It begins green but progresses to red when the combatant is closer to running out of fractures.",
	  "title": "Fractures[0]"
    },
    {
      "type": "patchouli:text",
      "text": "$(l)\"Posture Break\"$()$(br)When a combatant's posture is emptied by posture damage they will take a $(#CCCC00)\"fracture\"$(). $(br2)Fractures are essentially a mark of combat damage and exhaustion. A combatant's max fractures is typically extended by attributes configured for different mobs or the player, but also by different types of armor and a mobs size." 
    },
    {
      "type": "patchouli:text",
      "text": "Players despite wearing no armor will typically have 3 potential fractures unless augmented, this lets your posture empty 3 times before you're in severe danger. Most normal player sized mobs will have one to two.$(br2)At the time of being fractured a combatant will also suffer one of 3 levels of debilitating combat states depending on their condition. These are covered in the other related pages."
    },
    {
      "type": "patchouli:text",
      "text": "Combatants are encouraged not to flee combat however, as simply the act of defying your opponent and defeating them will immediately cure you of all fractures you've suffered from them specifically. Exhausting all fractures and not dieing from the resultant finishing blows also resets your fractures. $(br2)If you really must escape from a fight: enemies who have despawned or become unloaded are also counted as gone, and upon killing another mob those \"unowned\" fractures will cease to ail you."
    }
  ]
}