{
  "name": "Parrying[2]: Tips etc",
  "icon": "wardance:textures/entry_icons/parry.png",
  "category": "patchouli:selfdefense",
  "sortnum": 2,
  "pages": [
    {
      "type": "patchouli:text",
      "text": "Be careful of what you're fighting, but also of it's gear! Because this means that a standard minecraft zombie hitting you by himself, deals less posture damage than a similar zombie whacking you with a shovel he happened to spawn with which has 6 posture damage in the default configs! $(br2)An amount of knockback is also causes sometimes popping you backwards or even launching you depending on the size of the blow deflected." 
    },
    {
      "type": "patchouli:text",
      "text": "A zombie will barely send you anywhere on parry, but a strong smash from a vindicator's axe or even a large mob like a ravager or iron golem will still knock you around considerably.$(br2)Some skills such as $(#0000FF)Mikiri$() or $(#FF0000)Overpower$() can modify parries to have additional effects periodically.$(br2)Most enemies who hold tools or weapons in their hands are also capable of parrying to defend against damage." 
    },

    {
      "type": "patchouli:text",
      "text": "Despite parrying existing blocking normally with a shield the default minecraft way still helps. We didn't get rid of that.$(br)In some cases due to the damage going to the shields durability instead it may save you some posture damage if you'd still prefer to shield block under some circumstances where you need to turtle up or delay.$(br)Just $(l)continue to be aware of attacks which can disable your shield$() as a shield that is disabled while blocking actively cannot parry passively while on cooldown."
    },
    {
      "type": "patchouli:text",
      "text": "Finally $(l)be cautious of a mobs height and position relative to you$(). Some enemy's attack damage hitboxes or directions might be different to the actual direction they're attacking from.$(br2)A simple example is trying to parry an enderman. If you're looking too far down he may hit you over the top of the parry blocking area due to your facing, especially if he's sticking too close to you or is above you."
    }
  ]
}